/**
Дан связный список целых чисел, организованный по принципу стека. Требуется написать функцию, удаляющую из заданного списка элементы, удовлетворяющие заданному критерию.
 Критерий передается в функцию посредством функционального указателя на логическую функцию целого чис-ла.
  Выделение дополнительной памяти (создание нового списка, создание дополнительных узлов) недопускается.
*/

/* Статус: не сделано */
/* Реализация: отсутствует */
#include<stdio.h>
#include<stddef.h>
#include<stdlib.h>
#include"sup.h"

int main()
{
    return 0;
}
